lpodkalicki/blog/avr/asm/include/m2560def.inc
; PRR1 - Power Reduction Register1
.equ	PRUSART1	= 0	; Power Reduction USART1
.equ	PRUSART2	= 1	; Power Reduction USART2
.equ	PRUSART3	= 2	; Power Reduction USART3
.equ	PRTIM3	= 3	; Power Reduction Timer/Counter3
.equ	PRTIM4	= 4	; Power Reduction Timer/Counter4
.equ	PRTIM5	= 5	; Power Reduction Timer/Counter5

; PRR0 - Power Reduction Register0
.equ	PRADC	= 0	; Power Reduction ADC
.equ	PRUSART0	= 1	; Power Reduction USART
.equ	PRSPI	= 2	; Power Reduction Serial Peripheral Interface
.equ	PRTIM1	= 3	; Power Reduction Timer/Counter1
.equ	PRTIM0	= 5	; Power Reduction Timer/Counter0
.equ	PRTIM2	= 6	; Power Reduction Timer/Counter2
.equ	PRTWI	= 7	; Power Reduction TWI


; ***** AD_CONVERTER *****************
; ADMUX - The ADC multiplexer Selection Register
.equ	MUX0	= 0	; Analog Channel and Gain Selection Bits
.equ	MUX1	= 1	; Analog Channel and Gain Selection Bits
.equ	MUX2	= 2	; Analog Channel and Gain Selection Bits
.equ	MUX3	= 3	; Analog Channel and Gain Selection Bits
.equ	MUX4	= 4	; Analog Channel and Gain Selection Bits
.equ	ADLAR	= 5	; Left Adjust Result
.equ	REFS0	= 6	; Reference Selection Bit 0
.equ	REFS1	= 7	; Reference Selection Bit 1

; ADCSRA - The ADC Control and Status register A
.equ	ADPS0	= 0	; ADC  Prescaler Select Bits
.equ	ADPS1	= 1	; ADC  Prescaler Select Bits
.equ	ADPS2	= 2	; ADC  Prescaler Select Bits
.equ	ADIE	= 3	; ADC Interrupt Enable
.equ	ADIF	= 4	; ADC Interrupt Flag
.equ	ADATE	= 5	; ADC  Auto Trigger Enable
.equ	ADSC	= 6	; ADC Start Conversion
.equ	ADEN	= 7	; ADC Enable

; ADCSRB - The ADC Control and Status register B
.equ	ADTS0	= 0	; ADC Auto Trigger Source bit 0
.equ	ADTS1	= 1	; ADC Auto Trigger Source bit 1
.equ	ADTS2	= 2	; ADC Auto Trigger Source bit 2
.equ	MUX5	= 3	; Analog Channel and Gain Selection Bits
;.equ	ACME	= 6	; 

; ADCH - ADC Data Register High Byte
.equ	ADCH0	= 0	; ADC Data Register High Byte Bit 0
.equ	ADCH1	= 1	; ADC Data Register High Byte Bit 1
.equ	ADCH2	= 2	; ADC Data Register High Byte Bit 2
.equ	ADCH3	= 3	; ADC Data Register High Byte Bit 3
.equ	ADCH4	= 4	; ADC Data Register High Byte Bit 4
.equ	ADCH5	= 5	; ADC Data Register High Byte Bit 5
.equ	ADCH6	= 6	; ADC Data Register High Byte Bit 6
.equ	ADCH7	= 7	; ADC Data Register High Byte Bit 7

; ADCL - ADC Data Register Low Byte
.equ	ADCL0	= 0	; ADC Data Register Low Byte Bit 0
.equ	ADCL1	= 1	; ADC Data Register Low Byte Bit 1
.equ	ADCL2	= 2	; ADC Data Register Low Byte Bit 2
.equ	ADCL3	= 3	; ADC Data Register Low Byte Bit 3
.equ	ADCL4	= 4	; ADC Data Register Low Byte Bit 4
.equ	ADCL5	= 5	; ADC Data Register Low Byte Bit 5
.equ	ADCL6	= 6	; ADC Data Register Low Byte Bit 6
.equ	ADCL7	= 7	; ADC Data Register Low Byte Bit 7

; DIDR0 - Digital Input Disable Register
.equ	ADC0D	= 0	; 
.equ	ADC1D	= 1	; 
.equ	ADC2D	= 2	; 
.equ	ADC3D	= 3	; 
.equ	ADC4D	= 4	; 
.equ	ADC5D	= 5	; 
.equ	ADC6D	= 6	; 
.equ	ADC7D	= 7	; 

; DIDR2 - Digital Input Disable Register
.equ	ADC8D	= 0	; 
.equ	ADC9D	= 1	; 
.equ	ADC10D	= 2	; 
.equ	ADC11D	= 3	; 
.equ	ADC12D	= 4	; 
.equ	ADC13D	= 5	; 
.equ	ADC14D	= 6	; 
.equ	ADC15D	= 7	; 


; ***** BOOT_LOAD ********************
; SPMCSR - Store Program Memory Control Register
.equ	SPMEN	= 0	; Store Program Memory Enable
.equ	PGERS	= 1	; Page Erase
.equ	PGWRT	= 2	; Page Write
.equ	BLBSET	= 3	; Boot Lock Bit Set
.equ	RWWSRE	= 4	; Read While Write section read enable
.equ	SIGRD	= 5	; Signature Row Read
.equ	RWWSB	= 6	; Read While Write Section Busy
.equ	SPMIE	= 7	; SPM Interrupt Enable


; ***** USART2 ***********************
; UDR2 - USART I/O Data Register
.equ	UDR2_0	= 0	; USART I/O Data Register bit 0
.equ	UDR2_1	= 1	; USART I/O Data Register bit 1
.equ	UDR2_2	= 2	; USART I/O Data Register bit 2
.equ	UDR2_3	= 3	; USART I/O Data Register bit 3
.equ	UDR2_4	= 4	; USART I/O Data Register bit 4
.equ	UDR2_5	= 5	; USART I/O Data Register bit 5
.equ	UDR2_6	= 6	; USART I/O Data Register bit 6
.equ	UDR2_7	= 7	; USART I/O Data Register bit 7

; UCSR2A - USART Control and Status Register A
.equ	MPCM2	= 0	; Multi-processor Communication Mode
.equ	U2X2	= 1	; Double the USART transmission speed
.equ	UPE2	= 2	; Parity Error
.equ	DOR2	= 3	; Data overRun
.equ	FE2	= 4	; Framing Error
.equ	UDRE2	= 5	; USART Data Register Empty
.equ	TXC2	= 6	; USART Transmitt Complete
.equ	RXC2	= 7	; USART Receive Complete

; UCSR2B - USART Control and Status Register B
.equ	TXB82	= 0	; Transmit Data Bit 8
.equ	RXB82	= 1	; Receive Data Bit 8
.equ	UCSZ22	= 2	; Character Size
.equ	TXEN2	= 3	; Transmitter Enable
.equ	RXEN2	= 4	; Receiver Enable
.equ	UDRIE2	= 5	; USART Data register Empty Interrupt Enable
.equ	TXCIE2	= 6	; TX Complete Interrupt Enable
.equ	RXCIE2	= 7	; RX Complete Interrupt Enable

; UCSR2C - USART Control and Status Register C
.equ	UCPOL2	= 0	; Clock Polarity
.equ	UCSZ20	= 1	; Character Size
.equ	UCSZ21	= 2	; Character Size
.equ	USBS2	= 3	; Stop Bit Select
.equ	UPM20	= 4	; Parity Mode Bit 0
.equ	UPM21	= 5	; Parity Mode Bit 1
.equ	UMSEL20	= 6	; USART Mode Select
.equ	UMSEL21	= 7	; USART Mode Select

; UBRR2H - USART Baud Rate Register High Byte
;.equ	UBRR8	= 0	; USART Baud Rate Register bit 8
;.equ	UBRR9	= 1	; USART Baud Rate Register bit 9
;.equ	UBRR10	= 2	; USART Baud Rate Register bit 10
;.equ	UBRR11	= 3	; USART Baud Rate Register bit 11

; UBRR2L - USART Baud Rate Register Low Byte
.equ	UBRR0	= 0	; USART Baud Rate Register bit 0
.equ	UBRR1	= 1	; USART Baud Rate Register bit 1
;.equ	UBRR2	= 2	; USART Baud Rate Register bit 2
;.equ	UBRR3	= 3	; USART Baud Rate Register bit 3
;.equ	UBRR4	= 4	; USART Baud Rate Register bit 4
;.equ	UBRR5	= 5	; USART Baud Rate Register bit 5
;.equ	UBRR6	= 6	; USART Baud Rate Register bit 6
;.equ	UBRR7	= 7	; USART Baud Rate Register bit 7


; ***** USART3 ***********************
; UDR3 - USART I/O Data Register
.equ	UDR3_0	= 0	; USART I/O Data Register bit 0
.equ	UDR3_1	= 1	; USART I/O Data Register bit 1
.equ	UDR3_2	= 2	; USART I/O Data Register bit 2
.equ	UDR3_3	= 3	; USART I/O Data Register bit 3
.equ	UDR3_4	= 4	; USART I/O Data Register bit 4
.equ	UDR3_5	= 5	; USART I/O Data Register bit 5
.equ	UDR3_6	= 6	; USART I/O Data Register bit 6
.equ	UDR3_7	= 7	; USART I/O Data Register bit 7

; UCSR3A - USART Control and Status Register A
.equ	MPCM3	= 0	; Multi-processor Communication Mode
.equ	U2X3	= 1	; Double the USART transmission speed
.equ	UPE3	= 2	; Parity Error
.equ	DOR3	= 3	; Data overRun
.equ	FE3	= 4	; Framing Error
.equ	UDRE3	= 5	; USART Data Register Empty
.equ	TXC3	= 6	; USART Transmitt Complete
.equ	RXC3	= 7	; USART Receive Complete

